[
    {
      "id": 1,
      "name": "Max",
      "breed": "Golden Retriever",
      "age": "2 years old",
      "type": "Dogs",
      "description": "Friendly and energetic Golden Retriever who loves to play fetch.",
      "gender": "Male",
      "weight": "65 lbs",
      "color": "Golden",
      "tags": ["Available", "Vaccinated", "Neutered/Spayed", "Good with Kids", "Good with Pets"],
      "adoptionFee": 150.00,
      "image": "/images/pets/max.jpg",
      "careDiet": "Thrives on a balanced diet of high-quality dog food suitable for breed and age. Recommend feeding twice daily with appropriate portion sizes based on weight and activity level. Ensure fresh water is always available.",
      "careExercise": "Regular exercise is crucial for physical and mental health. Daily walks, runs, and playtime like fetch are highly recommended for this energetic breed.",
      "careGrooming": "Regular brushing (several times a week) helps manage shedding and keeps coat healthy. Occasional baths, regular nail trims, and ear checks are needed."
    },
    {
      "id": 2,
      "name": "Bella",
      "breed": "Labrador",
      "age": "3 years old",
      "type": "Dogs",
      "description": "Sweet and gentle Labrador who loves swimming and playing with kids.",
      "gender": "Female",
      "weight": "70 lbs",
      "color": "Yellow",
      "tags": ["Available", "Vaccinated", "Good with Kids", "Good with Pets"],
      "adoptionFee": 160.00,
      "image": "/images/pets/bella.jpg",
      "careDiet": "Needs a balanced diet of high-quality dog food. Monitor portions carefully based on weight and activity level as Labradors can be prone to weight gain. Feed twice daily. Ensure fresh water access.",
      "careExercise": "Requires significant regular exercise. Daily walks, swimming (if possible), and active playtime are essential for this breed's well-being.",
      "careGrooming": "Short coat requires minimal grooming, but regular brushing helps manage shedding. Check ears regularly, especially after swimming. Needs nail trims."
    },
    {
      "id": 3,
      "name": "Charlie",
      "breed": "Beagle",
      "age": "4 years old",
      "type": "Dogs",
      "description": "Curious and playful Beagle with a great sense of smell.",
      "gender": "Male",
      "weight": "40 lbs",
      "color": "Tricolor",
      "tags": ["Available", "Vaccinated", "Neutered/Spayed", "Good with Pets"],
      "adoptionFee": 140.00,
      "image": "/images/pets/charlie.jpg",
      "careDiet": "Feed high-quality dog food twice daily, controlling portions as Beagles can gain weight easily. Their strong sense of smell might lead them to find extra food!",
      "careExercise": "Needs regular daily exercise, including walks on a leash (due to strong scent drive) and playtime in a securely fenced area.",
      "careGrooming": "Short coat is easy to maintain with weekly brushing. Pay special attention to ear cleaning as their floppy ears can trap dirt and moisture."
    },
    {
      "id": 4,
      "name": "Luna",
      "breed": "Siamese",
      "age": "1 year old",
      "type": "Cats",
      "description": "Playful Siamese cat with bright blue eyes and a loving personality.",
      "gender": "Female",
      "weight": "10 lbs",
      "color": "Cream",
      "tags": ["Available", "Vaccinated", "Good with Kids"],
      "adoptionFee": 120.00,
      "image": "/images/pets/luna.jpg",
      "careDiet": "Requires a high-quality cat food (wet and/or dry) appropriate for age and activity level. Feed scheduled meals (e.g., twice daily). Ensure constant access to fresh water.",
      "careExercise": "Siamese are active and vocal cats. Needs interactive playtime daily using toys like wands or laser pointers (used responsibly). Provide climbing structures like cat trees.",
      "careGrooming": "Short coat requires minimal grooming. Most cats groom themselves, but occasional brushing is beneficial, especially during shedding seasons. Monitor nail length."
    },
    {
      "id": 5,
      "name": "Milo",
      "breed": "British Shorthair",
      "age": "2 years old",
      "type": "Cats",
      "description": "Calm and gentle British Shorthair who loves to cuddle on the couch.",
      "gender": "Male",
      "weight": "12 lbs",
      "color": "Gray",
      "tags": ["Available", "Vaccinated", "Neutered/Spayed", "Good with Pets"],
      "adoptionFee": 130.00,
      "image": "/images/pets/milo.jpg",
      "careDiet": "Feed high-quality cat food appropriate for their age, controlling portions to maintain a healthy weight. Feed scheduled meals twice daily. Provide fresh water.",
      "careExercise": "Less active than some breeds but still enjoys moderate playtime. Engage with interactive toys daily. Provide scratching posts.",
      "careGrooming": "Dense coat needs regular brushing (at least weekly) to prevent matting and reduce shedding. Most cats groom themselves well."
    },
    {
      "id": 6,
      "name": "Nibbles",
      "breed": "Guinea Pig",
      "age": "6 months old",
      "type": "Rodents",
      "description": "Adorable Guinea Pig who enjoys eating lettuce and squeaking happily.",
      "gender": "Female",
      "weight": "2 lbs",
      "color": "Brown",
      "tags": ["Available", "Good with Kids"],
      "adoptionFee": 50.00,
      "image": "/images/pets/nibbles.jpg",
      "careDiet": "Requires constant access to high-quality Timothy hay, specific guinea pig pellets fortified with Vitamin C, and a daily portion of fresh vegetables (like romaine lettuce, bell peppers). Fresh water is essential.",
      "careExercise": "Needs a large, safe enclosure for movement and daily supervised floor time outside the cage in a pet-proofed area for exploration.",
      "careGrooming": "Generally clean animals. Long-haired breeds need regular brushing. Monitor teeth for overgrowth and nails for trimming."
    },
    {
      "id": 7,
      "name": "Whiskers",
      "breed": "Hamster",
      "age": "8 months old",
      "type": "Rodents",
      "description": "Tiny and energetic hamster who loves running in its wheel.",
      "gender": "Male",
      "weight": "0.5 lbs",
      "color": "White",
      "tags": ["Available"],
      "adoptionFee": 30.00,
      "image": "/images/pets/whiskers.jpg",
      "careDiet": "Feed a high-quality hamster food mix daily. Supplement with small amounts of fresh vegetables, fruits, or protein occasionally. Avoid sugary or unsafe foods. Provide fresh water.",
      "careExercise": "Requires a spacious cage with deep bedding for burrowing, an appropriately sized exercise wheel (solid surface), and chew toys. Safe, supervised out-of-cage time can be beneficial.",
      "careGrooming": "Self-groomers. Provide appropriate bedding material. Sand baths can be offered depending on the species (e.g., Dwarf hamsters)."
    },
    {
      "id": 8,
      "name": "Spike",
      "breed": "Bearded Dragon",
      "age": "3 years old",
      "type": "Reptiles",
      "description": "Friendly bearded dragon who enjoys basking under the heat lamp.",
      "gender": "Male",
      "weight": "18 lbs",
      "color": "Orange",
      "tags": ["Available", "Vaccinated", "Good with Pets"],
      "adoptionFee": 110.00,
      "image": "/images/pets/spike.jpg",
      "careDiet": "Omnivorous. Diet consists mainly of live insects (crickets, dubia roaches) gut-loaded and dusted with calcium/vitamins, plus a variety of leafy greens and vegetables offered daily.",
      "careExercise": "Needs a large terrarium with proper temperature gradients (basking spot, cool side) and full-spectrum UVB lighting for calcium metabolism. Provide climbing structures.",
      "careGrooming": "Minimal grooming. Requires occasional baths to aid shedding and hydration. Keep enclosure clean. Monitor for signs of stuck shed."
    },
    {
      "id": 9,
      "name": "Zara",
      "breed": "Leopard Gecko",
      "age": "1.5 years old",
      "type": "Reptiles",
      "description": "Colorful gecko who loves to explore and is easy to handle.",
      "gender": "Female",
      "weight": "1.2 lbs",
      "color": "Spotted",
      "tags": ["Available", "Good with Kids"],
      "adoptionFee": 90.00,
      "image": "/images/pets/zara.jpg",
      "careDiet": "Insectivorous. Primarily eats live insects like mealworms, crickets, and dubia roaches, properly gut-loaded and dusted with calcium and vitamin supplements.",
      "careExercise": "Nocturnal. Requires an appropriately sized terrarium with secure hides (warm, cool, humid), substrate for digging (optional), and a heat mat or lamp for belly heat (no UVB needed).",
      "careGrooming": "Minimal grooming. Monitor shedding; a humid hide is crucial to prevent stuck shed, especially on toes. Keep enclosure clean."
    }
  ]
  